---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults.Dispose
source: html/80d7f252-f52e-96cd-7704-58cc40d68957.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults.Dispose Method

Releases all resources used by the KeyBasedTreeEntriesLoadResults

## Syntax (C#)
```csharp
public void Dispose()
```